# я еще делаю!!!

"""Упражнение 67. Найти периметр многоугольника
Напишите программу для расчета периметра заданного многоугольника.
Начните с запроса у пользователя координат x и y первой точки много-
угольника. Продолжайте запрашивать координаты следующих точек фи-
гуры, пока пользователь не оставит строку ввода координаты по оси x
пустой. После ввода каждой пары значений вы должны вычислить длину
очередной стороны многоугольника и прибавить полученное значение
к будущему ответу. По окончании ввода необходимо вычислить расстояние
от последней введенной точки до первой, чтобы замкнуть фигуру,
и вывести итоговый результат. Пример ввода координат точек много-
угольника и вывода периметра показан ниже. Введенные пользователем
значения выделены жирным."""
res = list()
while True:
    x = input("Введите x")
    if not x:
        break
    y = input("введите y")
    res.append((x,y))
for cou_i,i in enumerate(res):





