from typing import Generator
from random import choice

"""
1
Напишите итератор колоды карт (52 карты). При вызове функции next() будет представлена следующая карта.

Каждая карта представлена в виде кортежа типа (2, 'пики').

    Номиналы: 1 — туз, 11 — валет, 12 — дама, 13 — король

    Порядок следования мастей: черви, бубны, пики, крести.
"""

cards = ((i, j) for j in ("черви", "бубны", "пики", "крести") for i in range(1, 14))
# maybe so: cards = ((i, j) for j in ("черви", "бубны", "пики", "крести") for i in list(range(2,14))+[1])
for i in range(52):
    print(cards.__next__(),end=" -> ")
print()
try:
    print(cards.__next__())
except StopIteration:
    print('iterator is listed')

"""
Реализуйте функцию-генератор для получения перемешанной колоды.
Подсказка: используйте функцию choice() из модуля random
"""


cards_2 = ((i, j) for j in ("черви", "бубны", "пики", "крести") for i in range(1, 14))


def random_card_gen(cards: Generator) -> Generator:
    lk = list(cards)
    while lk:
        rand_card = choice(lk)
        lk.remove(rand_card)
        yield rand_card


random_set = random_card_gen(cards_2)

for i in random_set:
    print(i,end=" -> ")


"""
(1, 'черви') -> (2, 'черви') -> (3, 'черви') -> (4, 'черви') -> (5, 'черви') -> (6, 'черви') -> (7, 'черви') -> (8, 'черви') -> (9, 'черви') -> (10, 'черви') -> (11, 'черви') -> (12, 'черви') -> (13, 'черви') -> (1, 'бубны') -> (2, 'бубны') -> (3, 'бубны') -> (4, 'бубны') -> (5, 'бубны') -> (6, 'бубны') -> (7, 'бубны') -> (8, 'бубны') -> (9, 'бубны') -> (10, 'бубны') -> (11, 'бубны') -> (12, 'бубны') -> (13, 'бубны') -> (1, 'пики') -> (2, 'пики') -> (3, 'пики') -> (4, 'пики') -> (5, 'пики') -> (6, 'пики') -> (7, 'пики') -> (8, 'пики') -> (9, 'пики') -> (10, 'пики') -> (11, 'пики') -> (12, 'пики') -> (13, 'пики') -> (1, 'крести') -> (2, 'крести') -> (3, 'крести') -> (4, 'крести') -> (5, 'крести') -> (6, 'крести') -> (7, 'крести') -> (8, 'крести') -> (9, 'крести') -> (10, 'крести') -> (11, 'крести') -> (12, 'крести') -> (13, 'крести') -> 
iterator is listed
(13, 'бубны') -> (9, 'крести') -> (12, 'черви') -> (5, 'крести') -> (6, 'крести') -> (11, 'пики') -> (10, 'бубны') -> (11, 'бубны') -> (9, 'черви') -> (1, 'пики') -> (10, 'черви') -> (2, 'черви') -> (12, 'бубны') -> (9, 'пики') -> (2, 'пики') -> (2, 'крести') -> (6, 'пики') -> (11, 'крести') -> (7, 'пики') -> (6, 'бубны') -> (8, 'пики') -> (5, 'черви') -> (2, 'бубны') -> (8, 'черви') -> (1, 'бубны') -> (10, 'пики') -> (7, 'черви') -> (7, 'крести') -> (13, 'пики') -> (8, 'крести') -> (8, 'бубны') -> (13, 'черви') -> (13, 'крести') -> (10, 'крести') -> (3, 'бубны') -> (5, 'бубны') -> (6, 'черви') -> (11, 'черви') -> (5, 'пики') -> (3, 'пики') -> (4, 'черви') -> (1, 'крести') -> (4, 'бубны') -> (12, 'крести') -> (4, 'крести') -> (3, 'крести') -> (7, 'бубны') -> (4, 'пики') -> (9, 'бубны') -> (3, 'черви') -> (12, 'пики') -> (1, 'черви') -> 

"""